In [26]:
#Missing data values and cleaning data 
#Data types in the data set?
#Can missing values ,null values be found using pandas?
#what are the other obvious missing data that cant be found using Pandas?

import pandas as pd 
import numpy as np
df = pd.read_csv(r'C:\Users\SRIVIDHYA\Desktop\property data.csv')
df.head(10)
# the features of data set ie columns

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3        1  1000
1  100002000.0   197.0   LEXINGTON            N            3      1.5    --
2  100003000.0     NaN   LEXINGTON            N          NaN        1   850
3  100004000.0   201.0    BERKELEY           12            1      NaN   700
4          NaN   203.0    BERKELEY            Y            3        2  1600
5  100006000.0   207.0    BERKELEY            Y          NaN        1   800
6  100007000.0     NaN  WASHINGTON          NaN            2   HURLEY   950
7  100008000.0   213.0     TREMONT            Y            1        1   NaN
8  100009000.0   215.0     TREMONT            Y           na        2  1800

In [27]:
#to find the data types
df.dtypes

PID             float64
ST_NUM          float64
ST_NAME          object
OWN_OCCUPIED     object
NUM_BEDROOMS     object
NUM_BATH         object
SQ_FT            object
dtype: object

In [16]:
# to find the  missing values 
#pandas recongnise both the empty and na values as null values 
#df.isnull()
# a particular column in the data frame is checked for null values 
df['ST_NUM'].isnull()

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7    False
8    False
Name: ST_NUM, dtype: bool

In [29]:
#we know that pandas recognize na and empty as null values
# what about other missing values such as n/a,--,
# to make recognize such missing  values make a list of such values while importing the data 
missing_values =['n/a','na','--']

df = pd.read_csv(r'C:\Users\SRIVIDHYA\Desktop\property data.csv',na_values = missing_values)


df['SQ_FT'].isnull()

0    False
1     True
2    False
3    False
4    False
5    False
6    False
7     True
8    False
Name: SQ_FT, dtype: bool

In [30]:
#to fill the missing values that are of different data type than the expected
#missing vales are usually sentinel values with some data type conversion as nan,none 
#none is object dtype and operations cant be carried with none
#nan is a special floating point type and operations could be done.
# string data in panda is object dtype


cnt = 0
for row in df ['OWN_OCCUPIED']:
    try:
        int (row)
        print (row)
        df.loc[cnt,'OWN_OCCUPIED']= np.nan
    except ValueError:
        pass
    cnt+= 1

12

In [31]:
x = pd.Series(range(2), dtype=int)
x

0    0
1    1
dtype: int32

In [18]:
x[0]  = None
x[0]

nan

In [25]:
# summarise the missing values 
df.isnull().sum()

PID             1
ST_NUM          0
ST_NAME         0
OWN_OCCUPIED    2
NUM_BEDROOMS    2
NUM_BATH        1
SQ_FT           1
dtype: int64

In [36]:

##fillout the missing values witha single value or with the median value 
df['ST_NUM'].fillna(125.0,inplace = True)
median = df['NUM_BEDROOMS'].median()
df['NUM_BEDROOMS'].fillna(median,inplace = True)

In [38]:
df.isnull()

     PID  ST_NUM  ST_NAME  OWN_OCCUPIED  NUM_BEDROOMS  NUM_BATH  SQ_FT
0  False   False    False         False         False     False  False
1  False   False    False         False         False     False   True
2  False   False    False         False         False     False  False
3  False   False    False          True         False      True  False
4   True   False    False         False         False     False  False
5  False   False    False         False         False     False  False
6  False   False    False          True         False     False  False
7  False   False    False         False         False     False   True
8  False   False    False         False         False     False  False